package com.chinatower.common.core.enums;

import com.chinatower.platform.enums.PGLayerTempEnums;
import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * @desription:
 * @data 创建时间：2024/5/7 16:18
 * @author chuan hao
 * @version 1.0
 *
 */
@Getter
@AllArgsConstructor
@SuppressWarnings("all")
public enum TkqCkqDMEnums {
    DM_11001("11001","煤","70010","能源矿","能"),
    DM_22001("22001","铁矿","70020","黑金属矿","黑"),
    DM_22002("22002","锰矿","70020","黑金属矿","黑"),
    DM_22003("22003","铬铁矿","70020","黑金属矿","黑"),
    DM_22004("22004","钛矿","70020","黑金属矿","黑"),
    DM_22005("22005","钒矿","70020","黑金属矿","黑"),
    DM_22006("22006","金红石","70020","黑金属矿","黑"),
    DM_32006("32006","铜矿","70030","有色金属矿","色"),
    DM_32007("32007","铅矿","70030","有色金属矿","色"),
    DM_32008("32008","锌矿","70030","有色金属矿","色"),
    DM_32009("32009","铝土矿","70030","有色金属矿","色"),
    DM_32010("32010","镁矿","70030","有色金属矿","色"),
    DM_32011("32011","镁矿","70030","有色金属矿","色"),
    DM_32012("32012","镍矿","70030","有色金属矿","色"),
    DM_32013("32013","钴矿","70030","有色金属矿","色"),
    DM_32014("32014","钨矿","70030","有色金属矿","色"),
    DM_32015("32015","锡矿","70030","有色金属矿","色"),
    DM_32016("32016","铋矿","70030","有色金属矿","色"),
    DM_32107("32017","钼矿","70030","有色金属矿","色"),
    DM_32108("32018","汞矿","70030","有色金属矿","色"),
    DM_32109("32019","锑矿","70030","有色金属矿","色"),
    DM_42101("42101","铂矿","70040","铂族金属矿","铂"),
    DM_42102("42102","钯矿","70040","铂族金属矿","铂"),
    DM_42103("42103","铱矿","70040","铂族金属矿","铂"),
    DM_42104("42104","铑矿","70040","铂族金属矿","铂"),
    DM_42105("42105","锇矿","70040","铂族金属矿","铂"),
    DM_42106("42106","钌矿","70040","铂族金属矿","铂"),
    DM_42200("42200","砂金","70050","贵金属矿","贵"),
    DM_42201("42201","金矿","70050","贵金属矿","贵"),
    DM_42202("42202","银矿","70050","贵金属矿","贵"),
    DM_52300("52300","铌钽矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52301("52301","铌矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52302("52302","钽矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52401("52401","铍矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52402("52402","锂矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52403("52403","锆矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52404("52404","锶矿(天青石)","70060","稀有稀土及分散元素矿","稀"),
    DM_52405("52405","铷矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52406("52406","铯矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52500("52500","重稀土矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52501("52501","钇矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52502("52502","钆矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52503("52503","铽矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52504("52504","镝矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52505("52505","钬矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52506("52506","铒矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52507("52507","铥矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52508("52508","镱矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52509("52509","镥矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52600("52600","轻稀土矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52601("52601","铈矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52602("52602","镧矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52603("52603","镨矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52604("52604","钕矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52605("52605","钐矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52606("52606","铕矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52701("52701","锗矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52702("52702","镓矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52703("52703","铟矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52704("52704","铊矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52705("52705","铪矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52706("52706","铼矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52707("52707","镉矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52708("52708","钪矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52709("52709","硒矿","70060","稀有稀土及分散元素矿","稀"),
    DM_52711("52711","碲矿","70060","稀有稀土及分散元素矿","稀"),
    DM_73030("73030","自然硫","70080","化工原料非金属矿","化"),
    DM_73070("73070","硫铁矿","70080","化工原料非金属矿","化"),
    DM_73240("73240","钠硝石","70080","化工原料非金属矿","化"),
    DM_73500("73500","明矾石","70080","化工原料非金属矿","化"),
    DM_73510("73510","芒硝(含钙芒硝)","70080","化工原料非金属矿","化"),
    DM_73530("73530","重晶石","70080","化工原料非金属矿","化"),
    DM_73600("73600","毒重石","70080","化工原料非金属矿","化"),
    DM_73610("73610","天然碱(Na₂CO₃)","70080","化工原料非金属矿","化"),
    DM_73901("73901","电石用灰岩","70080","化工原料非金属矿","化"),
    DM_73902("73902","制碱用灰岩","70080","化工原料非金属矿","化"),
    DM_73903("73903","化肥用石灰","70080","化工原料非金属矿","化"),
    DM_73942("73942","化肥用白云岩","70080","化工原料非金属矿","化"),
    DM_73953("73953","化肥用石英岩","70080","化工原料非金属矿","化"),
    DM_73975("73975","化肥用砂岩","70080","化工原料非金属矿","化"),
    DM_74080("74080","含钾岩石","70080","化工原料非金属矿","化"),
    DM_74090("74090","含钾砂页岩","70080","化工原料非金属矿","化"),
    DM_74512("74512","化肥用橄榄岩","70080","化工原料非金属矿","化"),
    DM_74532("74532","化肥用蛇纹岩","70080","化工原料非金属矿","化"),
    DM_74950("74950","泥炭","70080","化工原料非金属矿","化"),
    DM_75511("75511","岩盐","70080","化工原料非金属矿","化"),
    DM_75512("75512","湖盐","70080","化工原料非金属矿","化"),
    DM_75530("75530","镁盐","70080","化工原料非金属矿","化"),
    DM_75540("75540","天然卤水","70080","化工原料非金属矿","化"),
    DM_75550("75550","钾盐","70080","化工原料非金属矿","化"),
    DM_75690("75690","磷矿(主矿、共生矿)","70080","化工原料非金属矿","化"),
    ;
    /**
     * 矿种代码
     */
    private String dm;
    /**
     * 矿种名称
     */
    private String dmName;
    /**
     * 矿类
     */
    private String dmType;
    /**
     * 矿类名称
     */
    private String dmTypeName;
    /**
     * 简称
     */
    private String abbreviation;

    public static TkqCkqDMEnums get(String dm){
        for (TkqCkqDMEnums tempEnums : TkqCkqDMEnums.values()){
            if (tempEnums.getDm().equals(dm)){
                return tempEnums;
            }
        }
        return null;
    }
}
